Revit 2024 API
FabricationPart.DomainType Property
 The domain type for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ConnectorDomainType DomainType { get; }
Visual Basic
Public ReadOnly Property DomainType As ConnectorDomainType
	Get
Visual C++
public:
property ConnectorDomainType DomainType {
	ConnectorDomainType get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace